if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"
    brew "noti"
    brew "trash"

    # Applications
    cask "kitty"
    cask "imageoptim"
    cask "notion"
    cask "hazel"
    cask "anybar"
    cask "istat-menus"
    cask "rocket"
    cask "cleanshot"
    cask "vmware-fusion"
    cask "postman"
    1password
    cask "1password-cli"
    cask "android-studio"
    cask "anybar"
    cask "audio-hijack"
    cask "barrier"
    cask "betterzip"
    cask "blackhole"
    cask "blender"
    cask "choosy"
    cask "chromedriver"
    cask "cleanshot"
    cask "crosspack-avr"
    cask "cyberduck"
    cask "datagrip"
    cask "dbeaver-community"
    cask "docker"
    cask "farrago"
    cask "firebase-admin"
    cask "firefox"
    cask "font-3270-nerd-font"
    cask "font-cascadia-mono"
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "gfortran"
    cask "gimp"
    cask "goland"
    cask "google-chrome"
    cask "grandperspective"
    cask "graphiql"
    cask "handbrake"
    cask "hazel"
    cask "hyperswitch"
    cask "imageoptim"
    cask "insomnia"
    cask "iterm2"
    cask "jollysfastvnc"
    cask "kitty"
    cask "libreoffice"
    cask "loopback"
    cask "lyx"
    cask "mactex"
    cask "notion"
    cask "openemu"
    cask "osxfuse"
    cask "paw"
    cask "postico"
    cask "postman"
    cask "pycharm"
    cask "qlcolorcode"
    cask "qlmarkdown"
    cask "qlprettypatch"
    cask "qlstephen"
    cask "qlvideo"
    cask "quicklook-csv"
    cask "robo-3t"
    cask "rocket"
    cask "sequel-pro"
    cask "serial"
    cask "slack"
    cask "soundsource"
    cask "spectacle"
    cask "spotify"
    cask "storyboarder"
    cask "sublime-merge"
    cask "sublime-text"
    cask "suspicious-package"
    cask "swiftformat-for-xcode"
    cask "swimat"
    cask "synology-drive"
    cask "telegram"
    cask "textbar"
    cask "thunderbird"
    cask "tigervnc-viewer"
    cask "tikzit"
    cask "timing"
    cask "tor-browser"
    cask "transmission"
    cask "tunnelblick"
    cask "visual-studio-code"
    cask "vlc"
    cask "vmware-fusion"
    cask "whatsapp"
    cask "xquartz"

    # macOS App Store
    mas "Xcode", id: 497799835

end

tap "homebrew/bundle"
tap "homebrew/core"
tap "schniz/tap"
tap "buo/cask-upgrade"

# packages
brew "ack"
brew "antigen"
brew "bat"
brew "cloc"
brew "diff-so-fancy"
brew "entr"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "grep"
brew "highlight"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdown"
brew "neofetch"
brew "neovim"
brew "python"
brew "ripgrep"
brew "schniz/tap/fnm"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim"
brew "wdiff"
brew "wget"
brew "z"
brew "zsh"

brew "ack"
brew "adns"
brew "aom"
brew "apr"
brew "apr-util"
brew "aria2"
brew "aspell"
brew "atk"
brew "autoconf"
brew "automake"
brew "avrdude"
brew "bash"
brew "bat"
brew "bdw-gc"
brew "bit-git"
brew "boost"
brew "cabextract"
brew "cairo"
brew "ceres-solver"
brew "cfitsio"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "conan"
brew "coreutils"
brew "cppcheck"
brew "dav1d"
brew "davix"
brew "dict"
brew "diff-so-fancy"
brew "dnsmasq"
brew "docbook"
brew "docbook-xsl"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "eigen"
brew "elixir"
brew "emacs"
brew "enchant"
brew "entr"
brew "erlang"
brew "espeak"
brew "exa"
brew "exiftool"
brew "fastlane"
brew "fd"
brew "ffmpeg"
brew "fftw"
brew "firebase-cli"
brew "flac"
brew "fltk"
brew "fnm"
brew "fontconfig"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "fzf"
brew "gcc"
brew "gd"
brew "gdb"
brew "gdbm"
brew "gdk-pixbuf"
brew "gettext"
brew "gflags"
brew "gh"
brew "ghostscript"
brew "giflib"
brew "git"
brew "git-secrets"
brew "git-standup"
brew "gl2ps"
brew "glances"
brew "glib"
brew "glog"
brew "gmp"
brew "gnu-getopt"
brew "gnu-time"
brew "gnupg"
brew "gnutls"
brew "go"
brew "go-md2man"
brew "gobject-introspection"
brew "google-benchmark"
brew "gpac"
brew "gradle"
brew "graphite2"
brew "graphviz"
brew "grep"
brew "gsettings-desktop-schemas"
brew "gsl"
brew "gtk+"
brew "gtk+3"
brew "gts"
brew "guetzli"
brew "guile"
brew "harfbuzz"
brew "hdf5"
brew "hicolor-icon-theme"
brew "highlight"
brew "htop"
brew "httpie"
brew "hub"
brew "hwloc"
brew "icu4c"
brew "ilmbase"
brew "imagemagick"
brew "ipython"
brew "isl"
brew "jansson"
brew "jasper"
brew "jemalloc"
brew "jpeg"
brew "jpeg-turbo"
brew "jpegoptim"
brew "jq"
brew "jupyterlab"
brew "krb5"
brew "kubernetes-cli"
brew "lame"
brew "lazydocker"
brew "lazygit"
brew "ldns"
brew "leptonica"
brew "libass"
brew "libassuan"
brew "libbluray"
brew "libcbor"
brew "libde265"
brew "libelf"
brew "libepoxy"
brew "libevent"
brew "libffi"
brew "libfido2"
brew "libftdi0"
brew "libgcrypt"
brew "libgpg-error"
brew "libheif"
brew "libhid"
brew "libidn2"
brew "libksba"
brew "liblqr"
brew "libmaa"
brew "libmpc"
brew "libogg"
brew "libomp"
brew "libpng"
brew "libsamplerate"
brew "libscrypt"
brew "libsndfile"
brew "libsoxr"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libusb-compat"
brew "libuv"
brew "libvidstab"
brew "libvorbis"
brew "libvpx"
brew "libvterm"
brew "libxml2"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "lsusb"
brew "lua"
brew "luajit"
brew "lz4"
brew "lzo"
brew "make"
brew "makedepend"
brew "markdown"
brew "mas"
brew "metis"
brew "mongo-c-driver"
brew "mosh"
brew "mpfr"
brew "msgpack"
brew "mysql"
brew "nasm"
brew "ncdu"
brew "ncurses"
brew "neofetch"
brew "neovim"
brew "netcdf"
brew "netpbm"
brew "nettle"
brew "nginx"
brew "ninja"
brew "nmap"
brew "nnn"
brew "node"
brew "noti"
brew "npth"
brew "ntfs-3g"
brew "numpy"
brew "oniguruma"
brew "opam"
brew "open-mpi"
brew "openblas"
brew "opencore-amr"
brew "opencv"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openssh"
brew "openssl@1.1"
brew "opus"
brew "ossp-uuid"
brew "p11-kit"
brew "p7zip"
brew "pandoc"
brew "pango"
brew "pcre"
brew "pcre2"
brew "perl"
brew "pinentry"
brew "pinentry-mac"
brew "pipenv"
brew "pixman"
brew "pkg-config"
brew "popt"
brew "portaudio"
brew "postgresql"
brew "protobuf"
brew "pyqt"
brew "python@3.7"
brew "python@3.8"
brew "python@3.9"
brew "qemu"
brew "qt"
brew "rails-completion"
brew "rapidjson"
brew "rav1e"
brew "readline"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "root"
brew "rsync"
brew "rtmpdump"
brew "rubberband"
brew "ruby"
brew "ruby@2.5"
brew "sampler"
brew "scons"
brew "screenresolution"
brew "sdl2"
brew "sfml"
brew "shared-mime-info"
brew "shellcheck"
brew "sip"
brew "snappy"
brew "socat"
brew "speedtest-cli"
brew "speex"
brew "sqlite"
brew "srt"
brew "sshfs"
brew "starship"
brew "subversion"
brew "suite-sparse"
brew "swagger-codegen"
brew "swiftformat"
brew "swiftlint"
brew "szip"
brew "tbb"
brew "telnet"
brew "tesseract"
brew "texi2html"
brew "the_silver_searcher"
brew "theora"
brew "tig"
brew "tiger-vnc"
brew "tldr"
brew "tmux"
brew "tor"
brew "trash"
brew "tree"
brew "typescript"
brew "unbound"
brew "unibilium"
brew "unrar"
brew "utf8proc"
brew "vde"
brew "vim"
brew "vtk"
brew "wdiff"
brew "webp"
brew "wget"
brew "winetricks"
brew "wxmac"
brew "x264"
brew "x265"
brew "xmlto"
brew "xrootd"
brew "xvid"
brew "xxhash"
brew "xz"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zeromq"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zplug"
brew "zstd"
