if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"
    brew "noti"
    brew "trash"

    # Applications
    mas "Xcode", id: 497799835

    # Browsers
    # cask "firefox"

    # Fonts
    cask "font-fira-code"
    cask "font-hack"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-hack-nerd-font"

end

tap "homebrew/bundle"
tap "homebrew/core"
tap "schniz/tap"

# Useful Utilities
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "bash"
brew "bash-completion2"
brew "wget --with-iri"
brew "gnupg"
brew "gettext"
brew "pcre"
brew "pcre2"
brew "oniguruma"
brew "libidn2"
brew "xz"
brew "msgpack"
brew "openssl"
brew "gdbm"
brew "readline"
brew "watchman"

# Shells
brew "romkatv/powerlevel10k/powerlevel10k"

# Languages
brew "python"
brew "python@2"
brew "node"
brew "go"
brew "openjdk"
brew "scala"
brew "sbt"
brew "lua"
brew "luajit"

# Dependencies for other tools
brew "libvterm"
brew "libuv"
brew "libtermkey"
brew "unibilium"
brew "icu4c"
brew "libunistring"
brew "ncurses"

# Command line Tools
brew "ack"
brew "bat"
brew "cloc"
brew "diff-so-fancy"
brew "diskus"
brew "entr"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "grep"
brew "hexyl"
brew "highlight"
brew "homeshick"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdown"
brew "neofetch"
brew "neovim"
brew "pastel"
brew "ripgrep"
brew "schniz/tap/fnm"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim --with-override-system-vi"
brew "wdiff"
brew "wget"
brew "z"
brew "zsh"
